# FunctionId Properties

---
The FunctionId type exposes the following members.
| Name| Description
---|---|---
| File| The name of the file including the function throwing an exception.
| Function| The name of the function throwing an exception.
| Line| The line number of the function throwing an exception.
Top
#### Reference
FunctionId Class
Autodesk.Revit.Exceptions Namespace